app/controllers/decklist_controller.rb

SELECT "decklists".* FROM "decklists" WHERE "decklists"."user_id" = ?  [["user_id", 1]]
---
def view

if session.fetch( :user_id) == nil

  redirect_to("/", { :alert => "Must be logged in to access decklists" })

else

the_id = session.fetch( :user_id)
 @decklist = Decklist.all

@matching_decklist = Decklist.where({ :user_id => the_id })

INSERT INTO "decklists" ("user_id", "created_at", "updated_at", "quantity", "card_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["created_at", "2021-08-24 03:08:49.031554"], ["updated_at", "2021-08-24 03:08:49.031554"], ["quantity", 3], ["card_id", "hgss3-10"]]
---
def add

  the_decklist = Decklist.new
  the_decklist.user_id = session.fetch( :user_id)
  the_decklist.card_id = params.fetch("query_card_id")
  the_decklist.quantity = params.fetch("query_quantity")
  the_decklist.save

SELECT "decklists".* FROM "decklists" WHERE "decklists"."id" = ?  [["id", 9]]
DELETE FROM "decklists" WHERE "decklists"."id" = ?  [["id", 9]]
---
  def remove
    dc_id = params.fetch("dc_id")
    user_id = session.fetch( :user_id)
    removing_card = Decklist.where({ :id => dc_id }).at(0)

    removing_card.destroy