app/controllers/user_authentication_controller.rb

INSERT INTO "users" ("email", "password_digest", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new
    @user.email = params.fetch("query_email")
    @user.password = params.fetch("query_password")
    @user.password_confirmation = params.fetch("query_password_confirmation")
    @user.username = params.fetch("query_user_name")


    save_status = @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "ztorres1215@live.com"], ["LIMIT", 1]]
---
  def create_cookie
    user = User.where({ :email => params.fetch("query_email") }).first